Jewelbots/arduino-friendship/jewelbots_friendship_v001/boards.txt
nRF51822.name=JWB Friendship

nRF51822.upload.tool=JWBLoader
nRF51822.upload.protocol=
#nRF51822.upload.maximum_size=132096
#nRF51822.upload.maximum_data_size=16384
#nRF51822.upload.speed=38400
#nRF51822.upload.disable_flushing=false
#nRF51822.upload.use_1200bps_touch=false
#nRF51822.upload.wait_for_upload_port=false


nRF51822.build.mcu=cortex-m0
nRF51822.build.f_cpu=16000000
nRF51822.build.usb_product="Arduino Friendship”
nRF51822.build.board=Jewelbot_v1
nRF51822.build.core=Jewelbot_v1
nRF51822.build.variant=Jewelbot_v1
nRF51822.build.extra_flags=-mthumb
nRF51822.build.ldscript=linker_scripts/gcc/JWB_nRF51822.ld
nRF51822.build.Jewelbots_api_include="-I{runtime.platform.path}/cores/Jewelbot_v1/Jewelbots_src"
nRF51822.build.nrf_sdk_api_include="-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_advertising" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_db_discovery" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_debug_assert_handler" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_error_log" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_radio_notificaiton" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_services" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_services/ble_dfu" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_services/ble_dis" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/ble_services/ble_lbs" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/common" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/ble/peer_manager" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/device" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/ble_flash" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/clock" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/common" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/delay" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/gpiote" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/hal" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/pstorage/config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/pstorage" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/radio_config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/rng" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/spi_master" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/timer" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/twi_master" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/uart" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/drivers_nrf/wdt" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/bootloader_dfu" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/button" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/crc16" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/experimental_section_vars" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/fds/config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/fds" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/fifo" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/fstorage/config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/fstorage" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/gpiote" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/hci/config" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/hci" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/ic_info" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/mem_manager" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/scheduler" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/timer" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/trace" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/twi" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/uart" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/libraries/util" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/softdevice" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/softdevice/common" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/softdevice/common/softdevice_handler" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/softdevice/s130/hex" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/softdevice/s130/headers" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/toolchain" "-I{runtime.platform.path}/cores/Jewelbot_v1/nrf51_sdk/toolchain/CMSIS/Include"
